NCE2/L57 Can I help you, madam.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-20 Tue 22:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-orgf18d386" class="outline-2">
<h2 id="orgf18d386">Lesson 57 Can I help you, madam?</h2>
<div class="outline-text-2" id="text-orgf18d386">
<p class="verse">
Did the woman get what she wanted?<br />
<br />
A woman in jeans stood at the window of an expensive shop.<br />
Though she hesitated for a moment,<br />
&#xa0;she finally went in and <b>asked to see</b> a dress that was in the window.<br />
The assistant who served her did not like the way she was dressed.<br />
Glancing at her scornfully, he told her that the dress was sold.<br />
The woman walked out of the shop angrily and decided to punish the assistant next day.<br />
She returned to the shop the following morning <b>dressed in</b> a fur coat,<br />
&#xa0;with a handbag in one hand and a long umbrella in the other.<br />
After <b>seeking out</b> the rude assistant, she asked for the same dress.<br />
Not realizing who she was, the assistant <b>was eager to serve</b> her this time.<br />
With great difficulty, he climbed into the shop window to get the dress.<br />
As soon as she saw it, the woman said she did not like it.<br />
She enjoyed herself making the assistant bring almost everything in the window<br />
&#xa0;before finally buying the dress she had first asked for.<br />
</p>
</div>
<div id="outline-container-org598553a" class="outline-3">
<h3 id="org598553a">expression</h3>
<div class="outline-text-3" id="text-org598553a">
<p>
madam [ˈmædəm] n.太太,夫人<br />
jeans [dʒiːnz] n.牛仔裤<br />
hesitate [ˈhezɪteɪt] v.犹豫,迟疑<br />
serve [sɜːv] v.接待(顾客)<br />
scornfully [ˈskɔːnfəli] adv.轻蔑地<br />
punish [ˈpʌnɪʃ] v.惩罚<br />
fur [fɜː(r)] n.裘皮<br />
eager [ˈiːɡə(r)] adj.热切的,热情的<br />
</p>

<p>
hesitate to do sth. 犹豫做某事<br />
be eager to do sth. 渴望做某事<br />
ask/laugh/look at/ said + scornfully 轻蔑地问/笑/看/说<br />
look down on sb. 看不起某人<br />
</p>

<hr />
<p>
the way that/in which(可省略) + &#x2026;: 特殊的定语从句,从句修饰the way<br />
</p>
<ol class="org-ol">
<li>The assistant who served her did not like the way she was dressed.<br /></li>
<li>I don't like the way (that) you talk to me.<br /></li>
<li>We want to know the way (in which) you learn new words.<br /></li>
</ol>

<p>
ask to do sth. 请求做某事<br />
be dressed in &#x2026; 穿着<br />
seek out 寻找并找到<br />
make sb. do sth. 使(迫使)某人做某事<br />
</p>
</div>
</div>



<div id="outline-container-org9a7c2fb" class="outline-3">
<h3 id="org9a7c2fb">单词造句</h3>
</div>
<div id="outline-container-org445a26e" class="outline-3">
<h3 id="org445a26e">反复听电影片段</h3>
</div>
<div id="outline-container-orga512d9a" class="outline-3">
<h3 id="orga512d9a">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-org7b2d7b0" class="outline-3">
<h3 id="org7b2d7b0">给自己讲解</h3>
</div>
<div id="outline-container-orge60591e" class="outline-3">
<h3 id="orge60591e">红皮书</h3>
</div>
<div id="outline-container-org999931d" class="outline-3">
<h3 id="org999931d">习惯用法造句</h3>
</div>
<div id="outline-container-org38e2e1f" class="outline-3">
<h3 id="org38e2e1f">跟读至背诵</h3>
</div>
<div id="outline-container-org749b6c4" class="outline-3">
<h3 id="org749b6c4">Ask me if 写+读</h3>
</div>
<div id="outline-container-org7dc0218" class="outline-3">
<h3 id="org7dc0218">摘要写作</h3>
</div>
<div id="outline-container-org1bbd0f7" class="outline-3">
<h3 id="org1bbd0f7">tell the story 口语</h3>
</div>
<div id="outline-container-org92c901a" class="outline-3">
<h3 id="org92c901a">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
